---
kind: method
id: M:Autodesk.Revit.DB.CurveElementFilter.#ctor(Autodesk.Revit.DB.CurveElementType)
source: html/80512713-41ee-7a4b-ff48-1c66be59db7a.htm
---
# Autodesk.Revit.DB.CurveElementFilter.#ctor Method

Constructs a new instance of a filter to match specific types of curve elements.

## Syntax (C#)
```csharp
public CurveElementFilter(
	CurveElementType curveElementType
)
```

## Parameters
- **curveElementType** (`Autodesk.Revit.DB.CurveElementType`) - The curve element type to match.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - A value passed for an enumeration argument is not a member of that enumeration